app/controllers/answers_controller.rb

SELECT `answers`.* FROM `answers` WHERE `answers`.`qid` = 6 ORDER BY `answers`.`upvotes` DESC, `answers`.`downvotes` ASC
---
  def index
    render json: {answer: Answer.where(qid: params[:filter][:qid]).order(upvotes: :desc, downvotes: :asc)}

SELECT `answers`.* FROM `answers` WHERE `answers`.`qid` = 1
---
  def show
    render json: {answer: Answer.where(qid: params[:id])}

INSERT INTO `answers` (`qid`, `answer`, `created_at`, `upvotes`, `downvotes`) VALUES (3, 'Yes I can', '2017-12-14 10:08:25', 0, 0)
---
  def create
    @answer = Answer.new(answer_params)
    @answer.created_at = Time.now

UPDATE `answers` SET `answer` = 'Yes it can. Thats y u can see it done ' WHERE `answers`.`id` = 13
---
  def update
      if @answer.update(answer_params)

SELECT  `answers`.* FROM `answers` WHERE `answers`.`id` = 2 LIMIT 1
---
    def set_answer
      @answer = Answer.find(params[:id])