app/controllers/questions_controller.rb

SELECT `questions`.* FROM `questions` WHERE `questions`.`question` = 'ca'
SELECT `questions`.* FROM `questions` ORDER BY `questions`.`created_at` DESC
---
  def index
    if params[:filter].present?
      render json: {question: Question.where(question: params[:filter][:question])}
    else
      render json: {question: Question.order(created_at: :desc)}

SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 20 LIMIT 1
---
  def show
    render json: {question: Question.where(id: params[:id])}

INSERT INTO `questions` (`question`, `asked_by`, `created_at`, `inappropriate`) VALUES ('thiS is a demo ques', 'Arvind', '2017-12-15 06:15:07', NULL)
---
  def create
      @question = Question.new(question_params)
      @question.created_at = Time.now

SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 20 LIMIT 1
UPDATE `questions` SET `inappropriate` = 1 WHERE `questions`.`id` = 20
---
  def update
    @question = Question.find_by(id: params[:id])
    if @question.update(question_params)

SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 14 LIMIT 1
DELETE FROM `questions` WHERE `questions`.`id` = 14
---
  def destroy
    @question = Question.find_by(id: params[:id])
    @question.destroy