app/controllers/searches_controller.rb

	def index
		if params[:term].present?
			Rails.logger.debug "#{params[:term]}"
      		render json: {search: Question.where("question LIKE :query", query: "%#{params[:term]}%")}
---
SELECT `questions`.* FROM `questions` WHERE `questions`.`question` = 'c'